app/controllers/admin/homes_controller.rb

     def index
	    @totalAnnonce = Annonce.count
		@totalInscrit = User.count
---
SELECT COUNT(*) FROM `annonces`
SELECT COUNT(*) FROM `users`