app/views/fields/user_id_field/_index.html.erb

<% if field.data.to_i !=0 %>
   <%=User.find(field.data.to_i).username %>&nbsp;(id: <%=field.data.to_i%>)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1