app/views/privatepages/mesannonces.html.erb

  <tbody>
    <% Annonce.where(user_id: current_user.id).each do |annonce_| %>
---
SELECT `annonces`.* FROM `annonces` WHERE `annonces`.`user_id` = 1