app/views/privatepages/monprofil_partials/_messages.html.erb

SELECT  `photos`.* FROM `photos` WHERE `photos`.`user_id` = 2 AND `photos`.`role` = 'profil_pic' LIMIT 1
---

			  <% if Photo.find_by(user_id: message.user_id,role: :profil_pic).nil? %>

SELECT  `photos`.* FROM `photos` WHERE `photos`.`user_id` = 2 AND `photos`.`role` = 'profil_pic' LIMIT 1  [["user_id", 2], ["role", "profil_pic"], ["LIMIT", 1]]
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
			  <%else %>
				     <img src="/uploads/<%=Photo.find_by(user_id: message.user_id,role: :profil_pic).name%>" alt="Avatar" style="width:100%;">
				<%end %>
		    <%= User.find(message.user_id).username %>

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1  [["id", 2], ["LIMIT", 1]]
---
			    <i>
					<span  data-toggle="modal" data-target="#repondreModal" data-id="<%=message.user_id %>" data-username="<%= User.find(message.user_id).username %>" title="Répondre">