app/views/publicpages/lesannoncesde.html.erb

SELECT  `annonces`.`id`, `annonces`.`designation`, `annonces`.`description`, `annonces`.`created_at` FROM `annonces` WHERE `annonces`.`user_id` = 1 ORDER BY created_at DESC LIMIT 9 OFFSET 0
---
if params[:tri].nil?
    @annonces = Annonce.select(:id, :designation,:description,:created_at).where(user_id: @id_annonceur).order("created_at DESC").limit(params[:end]).offset(params[:start])

SELECT  `annonces`.`id`, `annonces`.`designation`, `annonces`.`description`, `annonces`.`created_at` FROM `annonces` WHERE `annonces`.`user_id` = 1 ORDER BY created_at DESC LIMIT 9 OFFSET 0
---
elsif params[:tri]!= "" && params[:offre] != ""
     @annonces = Annonce.select(:id, :designation,:description,:created_at).where(user_id: @id_annonceur ,categorie: params[:offre]).order("created_at DESC").limit(params[:end]).offset(params[:start])

SELECT COUNT(`annonces`.`id`) FROM `annonces` WHERE `annonces`.`user_id` IS NULL
---

	  <h3 style="float:right" ><%= params[:start].to_s+" - "+params[:end].to_s %> Sur <%= Annonce.select(:id).where(user_id: params["id"]).count.to_i %> Annonces</h3><br/><br/>

SELECT COUNT(`annonces`.`id`) FROM `annonces` WHERE `annonces`.`user_id` IS NULL
---
		<div class="text-center">
<% if Annonce.select(:id).where(user_id: params["id"]).count.to_i > 9 %>