app/views/annonces/index.html.erb

							<option value=""  >Offres </option>
						<% for annoncesC in Annonce.select(:categorie).distinct %>
---
SELECT DISTINCT `annonces`.`categorie` FROM `annonces`

							<!-- <option  value="" >Demandes</option> -->
                        <!-- <% for annonces in Annonce.select(:categorie).distinct %> -->
---
SELECT DISTINCT `annonces`.`categorie` FROM `annonces`

	  <br/>
	  <!-- <h3>Plus de <%= Annonce.all.count %> annonces .</h3> -->
---
SELECT COUNT(*) FROM `annonces`

		<div class="text-center">
		<% total = Annonce.all.count/10 %><% if (Annonce.all.count % 9) > 0 %> <% total = total +1 %><% end %>
---
SELECT COUNT(*) FROM `annonces`

				</ul>
				<%= params[:start].to_s+" - "+params[:end].to_s %> Sur <%= Annonce.all.count %> + plus
---
SELECT COUNT(*) FROM `annonces`