app/controllers/annonces_controller.rb

SELECT  `annonces`.`id`, `annonces`.`designation`, `annonces`.`valide` FROM `annonces` WHERE (prix BETWEEN 0 AND 50000) ORDER BY id DESC LIMIT 9 OFFSET 0
SELECT  `annonces`.`id`, `annonces`.`designation`, `annonces`.`valide` FROM `annonces` ORDER BY categorie,sous_categorie,ville,prix ASC LIMIT 9 OFFSET 0
---
  def index
    #@annonces = Annonce.all
    @user=current_user
    			if session[:sous_categorie].blank? && session[:pays].blank?
            		if params[:prix].to_s != "" && params[:demande].to_s == "" && params[:offre].to_s == ""
            			 @annonces = Annonce.select(:id, :designation, :valide).where("prix "+params[:prix].to_s).order("id DESC").limit(params[:end]).offset(params[:start])
            		elsif params[:demande].to_s != ""
            			 @annonces = Annonce.select(:id, :designation, :valide).where(categorie: params[:demande]).order("id DESC").limit(params[:end]).offset(params[:start])
            		 elsif  params[:offre].to_s != ""
            			 @annonces = Annonce.select(:id, :designation, :valide).where(categorie: params[:offre]).order("id DESC").limit(params[:end]).offset(params[:start])
            		 elsif @annonces.nil?
            			 @annonces = Annonce.select(:id, :designation, :valide).order("id DESC").limit(params[:end]).offset(params[:start])

SELECT  `annonces`.* FROM `annonces` WHERE `annonces`.`id` = 2 LIMIT 1  [["id", 2], ["LIMIT", 1]]
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `identities`.* FROM `identities` WHERE `identities`.`user_id` = 1 LIMIT 1
---
  def show
    @annonce = Annonce.find(params[:id])
    @user=User.find(@annonce.user_id)
    @photos =  @annonce.photos

    @message = Message.new
    if @user.online == 1
       @online = '<div class="font-weight-bold " ><span class="text-success">L\'annonceur est en ligne ;</span> envoyer lui un message .</div>'
    else
       @online = '<div class="font-weight-bold " ><span class="text-warning">L\'annonceur est deconnecté ;</span> laisser lui un message .</div>'
    end
    @annonceur = Identity.find_by(user_id: @annonce.user_id)

SELECT  `annonces`.* FROM `annonces` WHERE `annonces`.`id` = 2 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `annonces`.* FROM `annonces` WHERE `annonces`.`id` = 2 LIMIT 1  [["id", 2], ["LIMIT", 1]]
---
  def edit
      @annonce = Annonce.find(params[:id])
	    @user = User.find(@annonce.user_id)

INSERT INTO `annonces` (`designation`, `categorie`, `sous_categorie`, `pays`, `ville`, `quartier`, `je_suis_le`, `tel`, `description`, `prix`, `commission_agence`, `minimum`, `condition`, `nbr_menage`, `chambre`, `salon`, `situe_dans`, `cuisine`, `douche`, `wc`, `hopital`, `marche`, `ecole`, `service_public`, `aeroport`, `supermarche`, `hotel`, `bar_restaurant`, `mairie`, `centre_de_loisir`, `pharmacie`, `pressing`, `plage`, `station_d_essence`, `gare_routiere`, `climatisation`, `brasseur`, `parking`, `electricite`, `eau`, `voirie`, `terrasse`, `jardin`, `meubles`, `cours`, `machine_a_laver`, `chauffe_eau_toilette`, `placards`, `fibre_optique`, `adsl`, `reseaux_mobile`, `sat`, `wimax`, `blr`, `tv`, `caution_electricite_eau`, `localisation_longitude`, `localisation_latitude`, `user_id`, `created_at`, `updated_at`) VALUES ('ANNONCE TESTS ', 'Louer', 'Chambre', 'BJ', 'Aplahoue', 'Avédji', 'Agence immobilière', '00000000000000000000000000', '\r\n        TETTSTSG', 0, 0, '0 Mois ', 'Aucune', 0, 0, 0, 'Situé dans', 0, 0, 0, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, TRUE, '0', '', '', 1, '2018-11-12 18:42:21', '2018-11-12 18:42:21')
SELECT  `identities`.* FROM `identities` WHERE `identities`.`user_id` = 1 LIMIT 1
---
  def create
    @annonce = Annonce.new(annonce_params)
    @user=current_user
    respond_to do |format|
      if @annonce.save
          if Identity.find_by(user_id: current_user.id).nil?

UPDATE `annonces` SET `description` = '                  <option value=\"bbbbbbbgjxghcjv\">bbbbbbbgjxghcjv</option>\r\n\r\n        ', `plage` = TRUE, `station_d_essence` = TRUE, `brasseur` = TRUE, `parking` = TRUE, `electricite` = TRUE, `eau` = TRUE, `voirie` = TRUE, `terrasse` = TRUE, `jardin` = TRUE, `meubles` = TRUE, `cours` = TRUE, `machine_a_laver` = TRUE, `chauffe_eau_toilette` = TRUE, `placards` = TRUE, `tv` = TRUE, `updated_at` = '2018-11-12 16:28:56' WHERE `annonces`.`id` = 2
---
  def update
    respond_to do |format|
      if @annonce.update(annonce_params)

SELECT  `annonces`.* FROM `annonces` WHERE `annonces`.`id` = 2 LIMIT 1
---
    def set_annonce
      @annonce = Annonce.find(params[:id])