app/controllers/application_controller.rb

SELECT `users`.`id`, `users`.`username` FROM `users` WHERE `users`.`online` = 1 ORDER BY created_at DESC
SELECT  `photos`.* FROM `photos` WHERE `photos`.`role` = 'profil_pic' AND `photos`.`user_id` = 1 LIMIT 1
SELECT  `photos`.* FROM `photos` WHERE `photos`.`role` = 'profil_pic' AND `photos`.`user_id` = 1 LIMIT 1  [["role", "profil_pic"], ["user_id", 1], ["LIMIT", 1]]
---

            ############################# POUR LE CHAT ##########################

	users_= User.select(:id,:username).where(online: 1).order("created_at DESC")
	@users_online = []
	i=0
    for user_ in users_
        if !Photo.find_by(role:"profil_pic",user_id: user_.id).nil?
            profil_pic = '/uploads/'+Photo.find_by(role:"profil_pic",user_id: user_.id).name.to_s