app/controllers/identities_controller.rb

  def create
    @identity = Identity.new(identity_params)

    respond_to do |format|
      if @identity.save
---
INSERT INTO `identities` (`typeannonceur`, `name`, `country`, `city`, `adress`, `zip`, `about`, `user_id`, `created_at`, `updated_at`) VALUES ('Particulier', 'Ojel KOOLMAN', 'TOGO', 'Lomé', '24 Rue fo-koffie', '0000', 'Bla bla  !!! ', 2, '2018-11-13 14:46:26', '2018-11-13 14:46:26')