app/controllers/messages_controller.rb

INSERT INTO `messages` (`user_id`, `destinataire`, `message`, `created_at`, `updated_at`) VALUES (1, 1, '          Bonjour , je suis intéressée par votre annonce : Description. Message test .\r\n	   ', '2018-11-13 14:52:30', '2018-11-13 14:52:30')
---
  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save