app/controllers/photos_controller.rb

  def create
         @name = Time.now.strftime("%Y%d%M%H%M%s")
         uploaded_io = params[:photo][:photo]
      @extention = uploaded_io.original_filename[uploaded_io.original_filename.length-3.to_i..100].to_s
     @photo = Photo.new(role: params[:photo][:role], name:  @name+'.'+@extention, user_id: current_user.id)
if @extention =="png" || @extention =="PNG" || @extention =="jpg" || @extention =="JPG"  || @extention =="gif"  || @extention =="GIF"
     respond_to do |format|

      if photo=@photo.save
---
INSERT INTO `photos` (`role`, `name`, `user_id`, `created_at`, `updated_at`) VALUES ('profil_pic', '2018135918591542135560.jpg', 1, '2018-11-13 18:59:20', '2018-11-13 18:59:20')