app/controllers/privatepages_controller.rb

  def monprofil
      #DECLARATION ET INITIALISATION DES VARIABLES
      @contenu = params[:contenu] #LE contenu à affiché
      @user = current_user
      if Identity.find_by(user_id:@user.id).nil?
          @identity=Identity.new
      else
          @identity=Identity.find_by(user_id:@user.id)
      end


     @messages = Message.where(destinataire:  @user.id).limit(50).order("created_at DESC")




     #FIN DES DECLARATIONS

  if @contenu == "change_password"
     if params[:password] == params[:confirm_password]

       @user=User.find(current_user.id)
---
SELECT  `identities`.* FROM `identities` WHERE `identities`.`user_id` = 1 LIMIT 1
SELECT  `identities`.* FROM `identities` WHERE `identities`.`user_id` = 1 LIMIT 1  [["user_id", 1], ["LIMIT", 1]]
SELECT  `messages`.* FROM `messages` WHERE `messages`.`destinataire` = 2 ORDER BY created_at DESC LIMIT 50
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def global_var
    if Photo.find_by(user_id: current_user.id).nil?
          @photo=Photo.new

          @wall_pic_Photo = Photo.new
          @wall_pic_Photo_method = "create"

          @profil_pic_Photo = Photo.new
          @profil_pic_Photo_method = "create"

      end

      if Photo.find_by(role: "wall_pic", user_id: current_user.id).nil?
        @wall_pic_Photo = Photo.new
        @wall_pic_Photo_method = "create"
        @wall_pic_Photo_file = "/img/Inscrit_Wall_pic.png"
      else
        @wall_pic_Photo = Photo.find_by(role: "wall_pic", user_id: current_user.id)
        @wall_pic_Photo_method = "put"
        @wall_pic_Photo_file = "/uploads/"+@wall_pic_Photo.name
      end
      if Photo.find_by(role: "profil_pic", user_id: current_user.id).nil?
---
SELECT  `photos`.* FROM `photos` WHERE `photos`.`user_id` = 1 LIMIT 1
SELECT  `photos`.* FROM `photos` WHERE `photos`.`role` = 'wall_pic' AND `photos`.`user_id` = 1 LIMIT 1
SELECT  `photos`.* FROM `photos` WHERE `photos`.`role` = 'profil_pic' AND `photos`.`user_id` = 1 LIMIT 1  [["role", "profil_pic"], ["user_id", 1], ["LIMIT", 1]]

      end


      if Photo.find_by(role: "wall_pic", user_id: current_user.id).nil?
---
SELECT  `photos`.* FROM `photos` WHERE `photos`.`role` = 'wall_pic' AND `photos`.`user_id` = 1 LIMIT 1  [["role", "wall_pic"], ["user_id", 1], ["LIMIT", 1]]

        @wall_pic_Photo_method = "create"
        @wall_pic_Photo_file = "/img/Inscrit_Wall_pic.png"
      else
        @wall_pic_Photo = Photo.find_by(role: "wall_pic", user_id: current_user.id)
        @wall_pic_Photo_method = "put"
        @wall_pic_Photo_file = "/uploads/"+@wall_pic_Photo.name
      end
      if Photo.find_by(role: "profil_pic", user_id: current_user.id).nil?
---
SELECT  `photos`.* FROM `photos` WHERE `photos`.`role` = 'profil_pic' AND `photos`.`user_id` = 1 LIMIT 1  [["role", "profil_pic"], ["user_id", 1], ["LIMIT", 1]]