app/controllers/publicpages_controller.rb

        def accueil
			@accueil = Page.find(1)
			@annonce_id =[]
			for mise_en_avant in Annoncesmiseenavant.select('annonce_id').limit(3).order('created_at DESC')
				  @annonce_id.push(mise_en_avant.annonce_id.to_i)
			end
                @annonces = Annonce.find(@annonce_id)
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
SELECT  `annoncesmiseenavants`.`annonce_id` FROM `annoncesmiseenavants` ORDER BY created_at DESC LIMIT 3
SELECT  `annonces`.* FROM `annonces` WHERE `annonces`.`id` = 1 LIMIT 1

      def lesannoncesde
          @id_annonceur = params[:id_annonceur]
          @identite_annonceur = Identity.find_by(user_id: @id_annonceur)
          @user = User.find_by(@id_annonceur)
          @total_annonce = Annonce.select(:id).where(user_id: @id_annonceur).count
          if Photo.find_by(role: "wall_pic", user_id: @id_annonceur).nil?
             @photo_wall_annonceur = "Inscrit_Wall_pic.png"
       else
            @photo_wall_annonceur = Photo.find_by(user_id: @id_annonceur, role: "wall_pic").name
---
SELECT  `identities`.* FROM `identities` WHERE `identities`.`user_id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE (1) LIMIT 1
SELECT COUNT(`annonces`.`id`) FROM `annonces` WHERE `annonces`.`user_id` = 1
SELECT  `photos`.* FROM `photos` WHERE `photos`.`role` = 'wall_pic' AND `photos`.`user_id` = 1 LIMIT 1
SELECT  `photos`.* FROM `photos` WHERE `photos`.`role` = 'profil_pic' AND `photos`.`user_id` = 1 LIMIT 1