app/models/administrateur.rb

SELECT  `administrateurs`.* FROM `administrateurs` WHERE (lower(email)='administrateur' OR lower(username)='administrateur' OR lower(phonenumber)='administrateur') ORDER BY `administrateurs`.`id` ASC LIMIT 1
---
  def self.find_first_by_auth_conditions(warden_conditions)
    conditions = warden_conditions.dup
    if login = conditions.delete(:login)
      where(conditions.to_hash).where("lower(email)=:value OR lower(username)=:value OR lower(phonenumber)=:value", value: login.downcase).first
    else
      where(conditions.to_hash).first