app/models/user.rb

  def self.find_first_by_auth_conditions(warden_conditions)
       conditions = warden_conditions.dup
       if login = conditions.delete(:login)
           where(conditions.to_hash).where("lower(email)=:value OR lower(username)=:value OR lower(phonenumber)=:value", value: login.downcase).first
---
SELECT  `users`.* FROM `users` WHERE (lower(email)='moonsjok' OR lower(username)='moonsjok' OR lower(phonenumber)='moonsjok') ORDER BY `users`.`id` ASC LIMIT 1