app/controllers/users/sessions_controller.rb

UPDATE `users` SET `online` = 1, `updated_at` = '2018-11-13 14:42:15' WHERE `users`.`id` = 1
---
   def create
     super
     current_user.update_attribute(:online, 1)

UPDATE `users` SET `online` = 0, `updated_at` = '2018-11-12 18:51:08' WHERE `users`.`id` = 1
---
   def destroy
     current_user.update_attribute(:online, 0)